# TypeWallClosure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TypeWallClosure Property
ParameterTypeId Class See Also
---
"Wall Closure"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TypeWallClosure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TypeWallClosure As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TypeWallClosure {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace